src/cf/Documents/СписаниеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>СписаниеДенежныхСредств</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Оплаты</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Перевозка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Перевозка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУпр</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/СписаниеДенежныхСредств/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = 
		СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Дата КАК Период,
	|	Док.Валюта КАК Валюта,
	|	Док.Ссылка КАК Ссылка,
	|	Док.Организация КАК Организация
	|ПОМЕСТИТЬ Док
	|ИЗ
	|	Документ.СписаниеДенежныхСредств КАК Док
	|ГДЕ
	|	Док.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расшифровка.Ссылка КАК Ссылка,
	|	Расшифровка.Основание.Контрагент КАК Контрагент,
	|	Расшифровка.Основание КАК Основание,
	|	Расшифровка.Сумма КАК Сумма,
	|	Расшифровка.СуммаУпр КАК СуммаУпр,
	|	Расшифровка.Перевозка КАК Перевозка
	|ПОМЕСТИТЬ Расшифровка
	|ИЗ
	|	Документ.СписаниеДенежныхСредств.РасшифровкаПлатежа КАК Расшифровка
	|ГДЕ
	|	Расшифровка.Ссылка = &Ссылка";

	Запрос.Выполнить();
	
	ПодготовитьТаблицуВзаиморасчетыСКонтрагентами(Запрос, СтруктураДополнительныеСвойства);
	ПодготовитьТаблицуОплаты(Запрос, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеТаблицДляПроведения

Процедура ПодготовитьТаблицуВзаиморасчетыСКонтрагентами(Запрос, СтруктураДополнительныеСвойства)
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Период КАК Период,
	|	Док.Валюта КАК Валюта,
	|	Расшифровка.Контрагент КАК Контрагент,
	|	Расшифровка.Перевозка КАК Перевозка,
	|	Расшифровка.Основание КАК ДокументВзаиморасчетов,
	|	Док.Организация КАК Организация,
	|	СУММА(Расшифровка.Сумма) КАК Сумма,
	|	СУММА(Расшифровка.СуммаУпр) КАК СуммаУпр,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения
	|ИЗ
	|	Док КАК Док
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Расшифровка КАК Расшифровка
	|		ПО Док.Ссылка = Расшифровка.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Расшифровка.Основание,
	|	Расшифровка.Перевозка,
	|	Док.Организация,
	|	Расшифровка.Контрагент,
	|	Док.Период,
	|	Док.Валюта";
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетыСКонтрагентами", 
		Запрос.Выполнить().Выгрузить());	
	
КонецПроцедуры

Процедура ПодготовитьТаблицуОплаты(Запрос, СтруктураДополнительныеСвойства)
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Период КАК Период,
	|	Док.Организация КАК Организация,
	|	Расшифровка.Контрагент КАК Контрагент,
	|	СУММА(-Расшифровка.Сумма) КАК Сумма
	|ИЗ
	|	Док КАК Док
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Расшифровка КАК Расшифровка
	|		ПО Док.Ссылка = Расшифровка.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Док.Период,
	|	Док.Организация,
	|	Расшифровка.Контрагент";
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОплаты", 
		Запрос.Выполнить().Выгрузить());	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
